Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: Xcode displays the property list editor in the editor area.
ja: Xcodeは、プロパティリストエディタをエディタ区画で表示します。

source: Xcode has already created a unit test file as part of the Single View Application template.
ja: Xcodeは、既にユニットテストファイルをSingle View Applicationひな形の一部として作成しています。

source: Xcode includes all the features you need to design, develop, and debug an app.
ja: Xcodeは、あなたがアプリの設計、開発、そしてデバッグに必要とするすべての機能を含みます。

source: Xcode includes everything you need to create an app.
ja: Xcodeは、あなたがアプリを作成するのに必要なものすべてを含んでいます。

source: Xcode includes several built-in app templates for developing common types of iOS apps, such as games, apps with tab-based navigation, and table view-based apps.
ja: Xcodeは、いくつかの組み込みのアプリテンプレート（アプリひな形）を、一般的な種類のiOSアプリ、例えばゲーム、タブに基づくナビゲーションを持つアプリ、およびテーブルビューに基づくアプリなどの開発のために含んでいます。

source: Xcode inserts the initializer skeleton for you.
ja: Xcodeはそのイニシャライザの骨組みをあなたの代わりに挿入します。

source: Xcode inserts the whole line for you.
ja: Xcodeは、行全体をあなたの代わりに挿入します。

source: Xcode is downloaded into your /Applications directory.
ja: Xcodeがあなたの/Applicationsディレクトリにダウンロードされます。

source: Xcode lets you type in a new name for the file.
ja: Xcodeは、あなたにこのファイルのための新しい名前を入力させます。

source: Xcode lists each of these comments as a section title in the source code file’s Functions menu, which appears if you click the name of the file at the top of the editor area.
ja: Xcodeは、それらコメントそれぞれをソースコードファイルの持つFunctions menuにおける部門タイトルとしてリストします、それはあなたがそのファイル名をエディタ区画の最上部でクリックするならば現れます。

source: Xcode makes it clear from the naming that you’re creating a custom table view cell, so leave the new name as is.
ja: Xcodeにはその名前の付け方からあなたがカスタムテーブルセルを作成しているのが明らかです、それで新しい名前はそのままにされます。

source: Xcode opens a new window and displays a dialog in which you choose a template.
ja: Xcodeは新しいウインドウを開きダイアログを表示します、そこであなたはあるひな形を選びます。

source: Xcode opens the source file in the main editor area of the window.
ja: Xcodeは、ソースファイルをウインドウ中央の大きなエディタ区画で開きます。

source: Xcode opens the storyboard in Interface Builder—its visual interface editor—in the editor area.
ja: Xcodeは、ストーリーボードをエディタ区画のインターフェイスビルダーで—それの視覚インターフェイスエディタで—開きます。

source: Xcode opens your new project in the workspace window.
ja: Xcodeは、あなたの新しいプロジェクトをワークスペースウインドウ（作業場）で開きます。

source: Xcode provides a library of objects that you can add to a storyboard file.
ja: Xcodeは、あなたがストーリーボードファイルに加えることができるオブジェクトのライブラリ（オブジェクトの図書館）を提供します。

source: Xcode uses the product name you entered to name your project and the app.
ja: Xcodeはあなたが入力した製品名を使ってあなたのプロジェクトとアプリを命名します。

source: Xcode wraps the user interface elements in a stack view, stacking them together.
ja: Xcodeは、それらのユーザインターフェイス要素をひとつのスタックに包んで（ラップして）、それらを積み重ねて一緒にします。

source: You adopt a protocol by listing it as part of the class declaration line.
ja: あなたは、あるプロトコルをクラス定義行の一部としてそれをリストすることによって採用します。

source: You access these constants using the structure’s name (for example, PropertyKey.name).
ja: あなたは、これら定数に構造体の名前（例えば、PropertyKey.name）を使ってアクセスします。

source: You accomplish this by adding an Edit button to the table view’s navigation bar.
ja: あなたは、これをEditボタンをテーブルビューのナビゲーションバーに追加することによって成し遂げます。

source: You added sample data to the model, and you implemented the table view controller code needed to dynamically fill the table with the model data.
ja: あなたは、見本データをモデルに追加しました、そしてあなたは動的にテーブルをモデルデータで満たすために必要とされるテーブルビューコントローラコードを実装しました。

source: You also design custom table cells to display each meal, which look like this:
ja: あなたはまた、カスタムテーブルセルを設計して各食事を表示します、それはこのように見えます：

source: You also examined the difference between regular initializers and failable initializers.
ja: あなたはまた、通常のイニシャライザと失敗できるイニシャライザの間の違いを検討しました。

source: You also need to keep a list of those meals.
ja: あなたはまたそれら食事のリストを保持する必要があります。

source: You also need to update the button’s selection state whenever buttons are added to the control.
ja: あなたはまた、ボタンがコントロールへ追加されるときはいつでもボタンの選択状態を更新する必要があります。

source: You are using red so it’s easy to see where the view is.
ja: あなたはredを使っています、なのでビューがあるところを確認するのは簡単です。

source: You attached your model object to your table view controller.
ja: あなたは、あなたのモデルオブジェクトをあなたのテーブルビューコントローに取り付けました。

source: You can add additional XCTestCase subclasses to your FoodTrackerTests target to add additional test cases.
ja: あなたは、追加的なXCTestCaseサブクラスをFoodTrackerTestsターゲットに追加して、追加的なテスト項目を加えることができます。

source: You can add your own code to customize the view controller’s response to these events.
ja: あなたは、あなた独自のコードを加えることで、これらのイベントへのビューコントローラの応答をカスタマイズできます。

source: You can add your own comments to help you understand what’s happening in your code.
ja: あなたは、あなた自身のコメントを加えて、あなたのコードにおいて何が起こっているかあなたが理解する助けとしてください。

source: You can add your own images directly into the simulator to test the FoodTracker app with appropriate sample content.
ja: あなたはあなた独自の画像を直接にシミュレータへと加えて、FoodTrackerアプリを適切なサンプル内容でテストすることができます。

source: You can also Option-click the Update Frames button to update only the selected view.
ja: あなたはまたUpdate Framesボタンをオプション-クリックすることで、選択されたビューのみを更新できます。

source: You can also collapse the outline view.
ja: あなたはまたアウトラインビューも折り畳むことができます。

source: You can also programmatically set a button to be selected or disabled.
ja: あなたはまた、プログラム的にボタンを選択または使用不能にされるようにできます。

source: You can also run an individual test.
ja: あなたはまた、個々のテストを実行できます。

source: You can also specify properties that can then be set in the Attributes inspector.
ja: あなたはまた幾つかのプロパティを指定でき、それらは後でAttributesインスペクタで設定されることができます。

source: You can choose a cell to delete by clicking the indicator on the left, and confirm that you want to delete it by pressing the Delete button in that cell.
ja: あなたは、削除するセルを左の表示をクリックして選べます、そしてそのセルにおいてDeleteボタンを押すことであなたがそれの削除を望むのを確認します。

source: You can click on one of the section titles to jump to that section in the file.
ja: あなたは、部門名の１つをクリックすることでファイルのその部門へジャンプすることができます。

source: You can click the Add button and navigate to the meal detail scene from the meal list scene.
ja: あなたは「追加」ボタンをクリックすることで、食事リストシーンから食事詳細シーンへと導かれます。

source: You can define an action method to accomplish anything from manipulating a piece of data to updating the user interface.
ja: あなたは、アクションメソッドを定義することで、あるデータ断片を操作することからユーザインターフェイスを更新することまでどんなことでも成し遂げます。

source: You can define the design and behavior of this cell.
ja: あなたは、このセルの設計と挙動を定義できます。

source: You can do this easily in your storyboard.
ja: あなたはこれを簡単にあなたのストーリーボードに行うことができます。

source: You can find a sample image within the Images/ folder of the downloadable file at the end of this lesson, or use your own image.
ja: あなたは、見本画像をこのレッスンの終わりでダウンロード可能なファイルのImages/フォルダ内で見つけることができます、またはあなた独自の画像を使うことができます。

source: You can find sample images within the Images/ folder of the downloadable file at the end of this lesson, or use your own images.
ja: あなたは見本画像をこのレッスンの終わりでダウンロード可能なファイルのImages/フォルダ内で見つけることができます、またはあなた独自の画像を使うことができます。

source: You can find the images shown above within the Images/ folder of the downloadable file at the end of this lesson, or use your own images.
ja: あなたは、上で見せた画像をこのレッスンの終わりでダウンロード可能なファイルのImages/フォルダ内で見つけることができます、またはあなた独自の画像を使うことができます。

source: You can jump to it quickly using the functions menu, which appears if you click the name of the file at the top of the editor area.
ja: あなたは、素早く関数メニューを使ってジャンプできます、それはあなたがファイルの名前をエディタ区画の上部でクリックするならば現れます。

source: You can leave this blank.
ja: あなたはこれを空白のままにできます。

source: You can now access the image view from code to change its image, but how do you know when to change the image?
ja: あなたは今やイメージビューにコードからアクセスしてそれの画像を変更できます、しかしあなたは画像を変更する時をどうやって知るのでしょう？

source: You can now add, edit, and delete meals.
ja: あなたは今や、食事の追加、編集、そして削除が可能です。

source: You can preview your app interface using the assistant editor, which displays a secondary editor side-by-side with your main one.
ja: あなたは、あなたのアプリのインターフェイスを、副次的なエディタをあなたの主要なものに並べて表示するアシスタントエディタを使ってプレビューすることができます。

source: You can represent the rating value with an Int, and the buttons as an array of UIButton objects.
ja: あなたは、格付けの値をIntを使って、そしてボタンをUIButtonオブジェクトの配列として表すことができます。

source: You can rerun a test method by moving the mouse over the success or failure icon.
ja: あなたは、成功または失敗アイコンの上でマウスを動かすことによってテストメソッドを再実行できます。

source: You can reuse the rating control class that you created in an earlier lesson.
ja: あなたは、あなたが前のレッスンで作成した格付けコントロールクラスを再利用できます。

source: You can select the screen size and orientation at the bottom of the canvas.
ja: あなたは、画面のサイズと方向をキャンバスの一番下で選択できます。

source: You can select the text field and type text into it.
ja: あなたは、テキスト欄を選択してテキストをそれの中へとタイプすることができます。

source: You can specify these kinds of interface rules easily using Auto Layout.
ja: あなたはこれらの種類のインターフェイス規則を「自動レイアウト」（自動配置）を使って簡単に指定できます。

source: You can then create a connection between those classes and scenes in your storyboard to get the behavior you defined in code and the user interface you defined in your storyboard.
ja: あなたはそれで、それらのクラスとあなたのストーリーボードの中のシーンの間の結合を作成することができ、あなたがコードにおいて定義した挙動とあなたがあなたのストーリーボードにおいて定義したユーザインターフェイスを得ます。

source: You can use a method that takes no arguments, that takes a single sender argument, or that takes both a sender and an event argument.
ja: あなたは、引数を取らない、単一のセンダー引数を取る、またはセンダーとイベント引数の両方を取る、あるメソッドを使うことができます。

source: You can use the outline view toggle to collapse and expand the outline view as needed.
ja: あなたはアウトラインビュー切替スイッチを使って、アウトラインビューを必要に応じて畳んだり広げたりできます。

source: You can use the stub methods and comments as a blueprint for designing many common app-level behaviors.
ja: あなたは、スタブメソッドとコメントを多くのよくあるアプリ水準挙動の設計のための青写真として使うことができます。

source: You can use this method to identify which segue is occurring, and display the appropriate information in the meal detail scene.
ja: あなたはこのメソッドを使って、どのセグエが生じているのか識別して、適切な情報を食事詳細シーンにおいて表示することができます。

source: You can write an action method that is called when a gesture recognizer recognizes its assigned gesture, which is exactly what you need to do for the image view.
ja: あなたは、あるジェスチャリコグナイザがそれの割当てジェスチャを認識するときに呼び出されるアクションメソッドを書くことができます、それは、まさしくあなたがイメージビューにする必要があるものです。

source: You care about configuring and passing the Meal only if the Save button was tapped.
ja: あなたがMealを構成して渡すことについて面倒を見るのは、Saveボタンがタップされた場合のみです。

source: You choose your own keys based on what makes the most sense in your app.
ja: あなたは、あなた独自のキーをあなたのアプリにおいて最も意味の通るものに基づき選びます。

source: You could modify the if clause, but complex Boolean expressions get hard to understand.
ja: あなたは、if節を修正することができます、しかし複合Boolean式は意味を取るのが困難になります。

source: You create an action the same way you create an outlet: Control-drag from a particular object in your storyboard to a view controller file.
ja: あなたは、アクションをあなたがアウトレットを作成したのと同じ方法で作成します：あなたのストーリーボードの中の特定のオブジェクトからビューコントローラファイルまでコントロールドラッグしてください。

source: You define the behavior of your view controllers in code by creating and implementing custom view controller subclasses.
ja: あなたは、コードにおいてあつらえのビューコントローラサブクラスを作成し実装することによって、あなたのビューコントローラの挙動を定義します。

source: You describe your layout using constraints—rules that explain where one element should be located relative to another, or what size the element should be.
ja: あなたは、あなたのレイアウトをいくらかの制約 — ある要素が別のものとの関係から位置すべきところを、または要素がどんな大きさであるべきかを、説明する規則を使って記述します。

source: You designed your custom rating control class to be interactive, but you don’t want users to be able to change the rating from the cell view.
ja: あなたは、あなたのカスタム格付けコントロールクラスを相互作用するように設計しました、しかしあなたはユーザに、格付けをセルビューから変更できることを望みません。

source: You do not need a development team to run the app in the simulator.
ja: あなたは、アプリをシミュレータで実行するのに開発チームを必要としません。

source: You do not need to be a Swift master to complete the lessons, but you will get more out of the lessons if you can comfortably read and understand Swift code.
ja: あなたは、このレッスンを完了するのにSwiftマスターである必要はありません、しかしあなたが楽にSwiftコードを読み理解できるならば、このレッスンからより多くのものを得るでしょう。

source: You do this by defining additional connections—called outlets and actions—between the views in the storyboard and the view controller source code files.
ja: あなたは、これを追加の接続—アウトレットおよびアクションと呼ばれるもの—をストーリーボードの中のビューとビューコントローラ・ソースコードファイルとの間に定義することによって行います。

source: You do this in the textFieldShouldReturn(_:) method, which gets called when the user taps Return (or in this case, Done) on the keyboard.
ja: あなたがこれを行うのはtextFieldShouldReturn(_:)メソッドにおいてです、それが呼ばれるのはユーザがリターン（またはこの場合、Done）をキーボード上でタップした時です。

source: You do this type of setup work is in the viewDidLoad() method.
ja: あなたがこの種の準備作業をするのは、viewDidLoad()メソッドにおいてです。

source: You don’t need this comment in your method implementation, so go ahead and delete it.
ja: あなたはこのコメントをあなたのメソッド実装において必要としません、それで先へ進んでそれは削除します。

source: You don’t need to do anything special to make sure these methods get called at the correct time—the application object handles that job for you.
ja: これらのメソッドが正しい時に呼ばれるのを確実にするのに、あなたが何か特別なことをする必要はありません—アプリケーションオブジェクトはその仕事をあなたの代わりに取り扱います。

source: You don’t want to let anything outside the RatingControl class access these buttons; therefore, you declare them as private.
ja: あなたは、RatingControlクラスの外側のどんなものもそれらのボタンにアクセスするのを望みません；それゆえにあなたはそれらをプライベートとして定義します。

source: You downcast the value returned by decodeObject(forKey:) as a UIImage, and assign it to the photo constant.
ja: あなたは、decodeObject(forKey:)によって返された値をUIImageとしてダウンキャウトします、そしてそれをphoto定数に割り当てます。

source: You just added a comment to your source code.
ja: あなたは、ただ単にコメントをあなたのソースコードに加えただけです。

source: You learned how to navigate back to a previous scene using segue unwinding, how to pass data across segues, and how to dismiss modal views.
ja: あなたは、以前のシーンにセグエ巻き戻しを使って戻っていく方法、データをセグエを超えて渡す方法、そしてモーダルビューを退去させる方法を学びました。

source: You mark these constants with the static keyword, which means they belong to the class instead of an instance of the class.
ja: あなたは、これらの定数をstaticキーワードで印します、それはそれらがクラスに属していることを意味します、クラスのインスタンスにではなくて。

source: You may also need to make changes to your code to get it to compile.
ja: あなたはまた、あなたのコードに変更を加えてそれを完成させる必要があるかもしれません。

source: You may have noticed that the value of the Type field defaults to AnyObject.
ja: あなたは、Type欄の値が初期状態でAnyObjectになっているのに気づくかもしれません。

source: You may have to click the disclosure triangles next to those objects to see the nested table view.
ja: あなたは、それらのオブジェクトの隣で開示三角形をクリックして入れ子にされたテーブルビューを見る必要があるでしょう。

source: You may have to disclose those objects to see the table view cell.
ja: あなたは、それらのオブジェクトを開いていって、テーブルビューセルを見なければならないでしょう。

source: You may need to update the frames in the meal detail scene, if they don’t update automatically.
ja: あなたは、食事詳細シーンの中のいくらかのフレームを、それらが自動的に更新しないならば、更新する必要があるでしょう。

source: You might notice that your table view has a bar on top of it now.
ja: あなたは、今ではあなたのテーブルビューがそれの上部にバーを持つことに気づくかもしれません。

source: You modified both the meal detail scene’s appearance and its behaviors based on how it was presented.
ja: あなたは、食事詳細シーンの外観とそれの挙動の両方をそれが提示された方法に基づいて修正しました。

source: You must check to see if the optional has a value, and then safely unwrap the value before you can use it.
ja: あなたは調査することで、そのオプショナルが値を持つかどうか見て、それから安全にその値をあなたがそれを使う前にアンラップしなければなりません。

source: You need a way to identify when the user is adding a new meal and when they are editing an existing one.
ja: あなたは、ユーザが新しい食事を追加している時と彼らが既存のものを編集している時を識別する方法が必要です。

source: You need a way to let users put the table view into an editing mode from which they can delete cells.
ja: あなたの必要なのは、ユーザにテーブルビューを編集モードの状態へ置かせることです、それによって彼らはセルを削除できます。

source: You need to add an action for this button (and for the other buttons you’ll be adding later).
ja: あなたは、あるアクションをこのボタンに（そしてあなたが後で加えることになる他のボタンに）加える必要があります。

source: You need to add code to check for those cases and to return nil if they fail.
ja: あなたが必要とするのはコードを加えてこれらの場合を検査して、それらが不合格ならnilを返すことです。

source: You need to be able to both read and write this value from outside this class.
ja: あなたは、この値の読み書き両方をこのクラスの外部から可能にする必要があります。

source: You need to change a few settings on this table view so you can use it in your app.
ja: あなたが必要とするのは、テーブルビュー上でいくつかの設定を変更して、それをあなたのアプリにおいて利用可能なものにすることです。

source: You need to downcast because sender.sourceViewController is of type UIViewController, but you need to work with a MealViewController.
ja: あなたはダウンキャストを必要とします、なぜならsender.sourceViewControllerは型UIViewControllerですが、あなたはMealViewControllerを扱うことを必要とします。

source: You need to give users a way to indicate that they want to change the image—for example, by tapping the image view.
ja: あなたが必要なのは、ユーザにある方法を与えて、彼らが画像を変更したいことを示させることです—たとえば、イメージビューをタップすることによって。

source: You need to implement both the encode(with:) method and the initializer for the data to save and load properly.
ja: あなたは、適切にデータを保存してロードするためにencode(with:)メソッドとイニシャライザの両方を実装する必要があります。

source: You need to specify that the text field should resign its first-responder status when the user taps a button to end editing in the text field.
ja: あなたが指定する必要があるのは、ユーザがあるボタンをタップした時にテキスト欄での編集を終わるためにテキスト欄がそれのファーストレスポンダ状態をやめることです。

source: You now have a fully functional app.
ja: あなたは今完全に機能するアプリを持ちます。

source: You now have a way to identify the Save button.
ja: あなたは今ではSaveボタンを識別する方法を持ちます。

source: You now have two scenes, one for displaying the meal list and one for displaying the details of a single meal.
ja: あなたは今では２つのシーンを持ちます、食事リストを表示するためのものと１つの食事の詳細を表示するためのもの。

source: You only need an outlet to an interface object if you plan to either access a value from the interface object or modify the interface object in your code.
ja: あなたはあるインターフェイスオブジェクトに対するアウトレットを必要とするだけです、もしあなたがある値にインターフェイスオブジェクトからアクセスするかインターフェイスオブジェクトをあなたのコードにおいて修正するかどちらかを行うつもりならば。

source: You removed the comment that says #warning Incomplete implementation because you’ve completed the implementation.
ja: あなたは#warning Incomplete implementationというコメントを削除しました、なぜならあなたが実装を完了したからです。

source: You resize a user interface element by dragging its resize handles, which are small white squares that appear on the element’s borders.
ja: あなたは、ユーザインターフェイス要素をそれのリサイズハンドル、それは小さな四角形でその要素のへりに現れます、をドラッグすることによって大きさ調整します。

source: You reveal an element’s resize handles by selecting it.
ja: あなたは、ある要素のリサイズハンドルをそれを選択することによって見えるようにします。

source: You see exactly what you're building while you’re building it, get immediate feedback about what’s working and what’s not, and make instantly visible changes to your user interface.
ja: あなたは、あなたが作っているものをあなたがそれを作っている時に正確に見て、何が機能して何がしないかについて直に反応を得ます、そして即座に視覚的変更をあなたのユーザインターフェイスに行います。

source: You separated this into its own method to make your code more modular and readable.
ja: あなたは、あなたのコードをよりモジュール化し読みやすくするために、これを独自のメソッドに分割しました。

source: You should be able to click a table view cell to navigate to the meal detail scene, and see it prepopulated with data about the meal.
ja: あなたはテーブルピューセルをクリックして食事詳細シーンに導かれます、そしてそれがその食事についてのデータで満たされるのを見るはずです。

source: You should be able to see a view with a small red square inside of it.
ja: あなたは、ビューと一緒に小さな赤い四角をそれの内部に見ることができるはずです。

source: You should be able to see the text field, label, and button you just added listed in the hierarchy.
ja: あなたは、あなたが加えたばかりのテキスト欄、ラベル、そしてボタンが階層中に記載されるのを見ることができるはずです。

source: You should be able to tap the image view to pull up an image picker.
ja: あなたは、イメージビューをタップしてイメージピッカーをプルアップできなければなりません。

source: You should see five stars and be able to click one to change the rating.
ja: あなたは、５つの星を見るはずです、そして１つクリックすることで格付けを変更できるはずです。

source: You should see stars instead of red buttons.
ja: あなたは、赤いボタンの代わりに星を見るはずです。

source: You should see the change in your user interface.
ja: あなたは、あなたのユーザインターフェイスにおいてこの変化を見るはずです。

source: You still need to create instances of this cell in code and fill them with your app’s data.
ja: あなたは依然としてこのセルのインスタンスいくらかをコードにおいて作成してそれらをあなたのアプリの持つデータで満たす必要があります。

source: You still see the meal detail scene, but there’s no longer a button to navigate back to the meal list—instead, you see the two buttons you added, Cancel and Save.
ja: あなたはやはり食事詳細シーンを見ます、しかしもはや食事リストに戻るよう導くボタンはありません—代わりに、あなたが加えた２つのボタン、CancelとSaveを見ます。

source: You typically create a view in one of two ways: by programatically initializing the view, or by allowing the view to be loaded by the storyboard.
ja: あなたは概して、ビューを２つのやり方のうちの１つで作成します：ビューをプログラム的に初期化（イニシャライズ）することで、またはビューをストーリーボードによってロードされるようにすることで。

source: You use actions to drive the flow of your app in response to user or system events.
ja: あなたはアクションを使って、あなたのアプリの流れ（フロー）をユーザやシステムのイベントに応じて動かします（駆動します）。

source: You use layout anchors to create constraints—in this case, constraints that define the view’s height and width, respectively.
ja: あなたは、レイアウトアンカーを使って制約を作成します — この場合には、それぞれビューの高さと幅を定義する制約。

source: You use storyboards to lay out the flow—or story—that drives your app.
ja: あなたはストーリーボードを使って、あなたのアプリを操作する流れ（フロー）—または物語（ストーリー）—を整えます。

source: You use the canvas to add and arrange user interface elements.
ja: あなたは、このキャンバスを使ってユーザインターフェイス要素を加えたり整えたりします。

source: You use the identifier when referring to the segue in code.
ja: あなたは、コードにおいてセグエを参照するときにこの識別子を使います。

source: You want the Add button (+) to bring up the meal detail scene, so you’ll do this by having the button trigger a segue (or transition) to that scene.
ja: あなたが追加ボタン（+）に望むことは、食事詳細シーンを画面に出すことです、それであなたは、このボタンがそのシーンへのセグエ（画面転換）を引き起こすようにしてこれを行います。

source: You want to return the number of meals you have.
ja: あなたが望むのはあなたが持つ食事の数を返すことです。

source: You will add additional configuration steps later in this lesson.
ja: あなたは、追加的な構成設定行程をこのレッスンの後で加えます。

source: You will fix that in the next lesson.
ja: あなたは、それを次のレッスンで修正します。

source: You will look at these methods after you have the model data set up.
ja: あなたは、これらのメソッドをあなたがモデルデータを準備し終えた後で見ることになります。

source: You will need to implement both of these methods in your custom control.
ja: あなたは、それらメソッドの両方をあなたのカスタムコントロールにおいて実装する必要があります。

source: You will use the label to show the meal’s name.
ja: あなたは、このラベルを使って食事の名前を表示します。

source: You will use this identifier to create instances of this prototype cell.
ja: あなたは、この識別子を使ってこの原型セルのインスタンスを作成します。

source: You won’t be modifying the button, so there’s no reason to create an outlet for it.
ja: あなたはボタンを修正することはしません、それでそれに対してアウトレットを作成する理由はありません。

source: You won’t need an XIB file for this view controller, because you have already defined its content in the app’s storyboard.
ja: あなたは、XIBファイルをこのビューコントローラのために必要としないでしょう、なぜならあなたは既にそれの内容をアプリのストーリーボードにおいて定義し終えたからです。

source: Your PropertyKey structure should look like this:
ja: あなたのPropertyKey構造体はこのように見えるはずです：

source: Your cancel(_:) action method should look like this:
ja: あなたのcancel(_:)アクションメソッドはこのように見えるはずです：

source: Your imagePickerController(_:didFinishPickingMediaWithInfo) method should look like this:
ja: あなたのimagePickerController(_:didFinishPickingMediaWithInfo)メソッドはこのようなものに見えるはずです：

source: Your imagePickerControllerDidCancel(_:) method should look like this:
ja: あなたのimagePickerControllerDidCancel(_:)メソッドはこのように見えるはずです：

source: Your init?(name:, photo:, rating:) method should look like this:
ja: あなたのinit?(name:, photo:, rating:)メソッドは、このように見えるはずです：

source: Your loadMeals() method should look like this:
ja: あなたのloadMeals()メソッドはこのように見えるはずです：

source: Your prepare(for:sender:) method should look like this:
ja: あなたのprepare(for:sender:)メソッドはこのように見えるはずです：

source: Your prepare(for:sender:) method should look something like this:
ja: あなたのprepare(for:sender:)メソッドはこのようなものに見えるはずです：

source: Your saveMeals() method should look like this:
ja: あなたのsaveMeals()メソッドはこのように見えるはずです：

source: Your selectImageFromPhotoLibrary(_:) action method should look like this:
ja: あなたのselectImageFromPhotoLibrary(_:)アクションメソッドはこのようなものに見えるはずです：

source: Your setDefaultLabelText(_:) action method should look like this:
ja: あなたのsetDefaultLabelText(_:)アクションメソッドは、このように見えるはずです：

source: Your setupButtons() method should look like this:
ja: あなたのsetupButtons()メソッドはこのように見えるはずです：

source: Your setupButtons() method should now look like this:
ja: あなたのsetupButtons()は、今やこのように見えるはずです：

source: Your tableView(_:cellForRowAt:) method should look like this:
ja: あなたのtableView(_:cellForRowAt:)メソッドはこのように見えるはずです：

source: Your tableView(_:commitEditingStyle:forRowAtIndexPath:) method should look like this:
ja: あなたのtableView(_:commitEditingStyle:forRowAtIndexPath:)メソッドはこのように見えるはずです：
